app/controllers/autenticacaos_controller.rb

SELECT * FROM `clientes` WHERE (`clientes`.`senha` = 'ldkjajfd' AND `clientes`.`nome` = 'tatskdj') LIMIT 1
---
	def create

		cliente = Cliente.find_by_nome_and_senha (params[:login], params[:senha])