app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT * FROM `comentarios`

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)

  def edit
    @comentario = Comentario.find(params[:id])
---
SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)

  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-07-06 23:57:25', 'Bla bla bla\r\nbla bla bla\r\n', 'massa', 0, '2010-07-06 23:57:25')

  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])
---
SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
UPDATE `comentarios` SET `comentavel_id` = 15, `updated_at` = '2010-07-07 00:00:36' WHERE `id` = 1

  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy
---
SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 5)
DELETE FROM `comentarios` WHERE `id` = 5