app/controllers/restaurantes_controller.rb

SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`
---
	def index
		@restaurantes = Restaurante.paginate :page=> params['page'], :per_page=>3

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 2)
---
	def show
		@restaurante = Restaurante.find(params[:id])

INSERT INTO `restaurantes` (`updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES('2010-07-05 23:12:20', 'Massa', 'Av do Autonomistas', 'Fasano', '2010-07-05 23:12:20')
---
	def create
		@restaurantes = Restaurante.new(params[:restaurante])

		if @restaurantes.save

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 2)
---
	def edit
		@restaurantes = Restaurante.find(params[:id])

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 2)
DELETE FROM `restaurantes` WHERE `id` = 2
---
	def destroy
		@restaurantes = Restaurante.find(params[:id])
		@restaurantes.destroy